Core/src/DataProcessors/ЗагрузкаКомерческихКурсовБанкрв/ЗагрузкаКомерческихКурсовБанкрв.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаКомерческихКурсовБанкрв</name>
  <attributes>
    <name>НазваниеБанка</name>
    <type>
      <types>EnumRef.ТипыОбменаСИнтернетБанком</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Core/src/InformationRegisters/КурсыВалютБанков/КурсыВалютБанков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалютБанков</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КурсПокупки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КратностьПокупки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КратностьПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсКросс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КратностьКросс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидКурса</name>
    <type>
      <types>EnumRef.ВидыКурсовВалютБанка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Банк</name>
    <type>
      <types>CatalogRef.Банки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВалютаПокупки</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВалютаПродажи</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/ВидыКурсовВалютБанка/ВидыКурсовВалютБанка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКурсовВалютБанка</name>
  <enumValues>
    <name>Коммерческий</name>
  </enumValues>
  <enumValues>
    <name>Кросс</name>
  </enumValues>
</mdclass:Enum>

Core/src/DataProcessors/ЗагрузкаКомерческихКурсовБанкрв/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекПользователь 	= ИнтеграцияСБанком_НаСервере.АвторизованныйПользователь();
	Организация 		= УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ТекПользователь, "ОсновнаяОрганизация");
	ВалютаУчета			= УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ВалютаУчета");
	
КонецПроцедуры                                        

&НаСервере
Функция ПолучитьМассивСтруктурВалют()
	
	МассивВозврата = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Валюты.Ссылка КАК Ссылка,
		|	Валюты.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	НЕ Валюты.ПометкаУдаления";
	
	тзРезультат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ВалютаПокупрки Из тзРезультат Цикл 
		
		Для Каждого ВалютаПродажи Из тзРезультат Цикл   
			Если ВалютаПокупрки.Наименование = ВалютаПродажи.Наименование Тогда 
				Продолжить;
			КонецЕсли;       
			СтруктураВалют = Новый Структура;
			СтруктураВалют.Вставить("SellCurrency", ВалютаПокупрки.Наименование);
			СтруктураВалют.Вставить("BuyCurrency", ВалютаПродажи.Наименование);     
			СтруктураВалют.Вставить("SellCurrencyСсылка", ВалютаПокупрки.Ссылка);
			СтруктураВалют.Вставить("BuyCurrencyСсылка", ВалютаПродажи.Ссылка);
			МассивВозврата.Добавить(СтруктураВалют);
		КонецЦикла; 
		
	КонецЦикла; 
	
	Возврат МассивВозврата;
	
КонецФункции

&НаКлиенте
Процедура Загрузить(Команда)  
	
	ТекущийПользователь	= ИнтеграцияСБанком_НаСервере.АвторизованныйПользователь();
	
	Если ProCredit Тогда 
		
		ПараметрыСоединенияProCredit = ИнтеграцияСБанкомProCredit_КлиентСервер.ПолучитьПараметрыСоединенияProCredit(ТекущийПользователь);     
		
		Токен = ИнтеграцияСБанком_НаСервере.ПолучитьТокенИзБазы("MIBGGE22");
		
		Если НЕ ЗначениеЗаполнено(Токен) Тогда
			
			СтруктураAuthToken = ИнтеграцияСБанкомProCredit_КлиентСервер.ПолучитьAuthToken(ПараметрыСоединенияProCredit);   
			
			Если НЕ СтруктураAuthToken.Успешно Тогда 
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru = 'Ошибка авторизации AuthToken: "+СтруктураAuthToken.Описание+"'; ka = 'Ошибка авторизации AuthToken: "+СтруктураAuthToken.Описание+" '");
				Сообщение.Сообщить();
				Возврат;
			КонецЕсли;
			
			ПараметрыСоединенияProCredit.Вставить("AuthToken", СтруктураAuthToken.ВозвращаемоеЗначение);
			
		Иначе
			
			ПараметрыСоединенияProCredit.Вставить("AccessToken", Токен);
			
		КонецЕсли;       
		
		МассивСтруктурВалют = ПолучитьМассивСтруктурВалют();
		
		Если ЗначениеЗаполнено(Токен) Тогда
			
			Для Каждого Валюты Из МассивСтруктурВалют Цикл 
				
				СтруктураФильтра = Новый Структура;
				СтруктураФильтра.Вставить("SellCurrency", Валюты.SellCurrency);
				СтруктураФильтра.Вставить("BuyCurrency", Валюты.BuyCurrency); 
				СтруктураФильтра.Вставить("SellCurrencyСсылка", Валюты.SellCurrencyСсылка);
				СтруктураФильтра.Вставить("BuyCurrencyСсылка", Валюты.BuyCurrencyСсылка);
				СтруктураФильтра.Вставить("Банк", Банк);
				
				СтруктураПарметровЗапросаВБанк = Новый Структура();
				СтруктураПарметровЗапросаВБанк.Вставить("ИмяМетода","GetRate"); 
				СтруктураПарметровЗапросаВБанк.Вставить("ИмяСервиса","api/Rate/GetRate");
				СтруктураПарметровЗапросаВБанк.Вставить("ФильтраЗапроса", СтруктураФильтра);
				
				ДополнительныеПараметрыОповещения = Новый Структура();
				ДополнительныеПараметрыОповещения.Вставить("ПараметрыСоединенияProCredit",ПараметрыСоединенияProCredit);
				ДополнительныеПараметрыОповещения.Вставить("СтруктураПарметровЗапросаВБанк",СтруктураПарметровЗапросаВБанк);
				
				ИнтеграцияСБанкомProCredit_КлиентСервер.ВыполнитьЗапросВБанк(ПараметрыСоединенияProCredit, СтруктураПарметровЗапросаВБанк);
				
				ОбработатьРезультатыПолученияКурсаБанкаИзProCredit(СтруктураПарметровЗапросаВБанк);
				
			КонецЦикла; 
			
		Иначе           
			
			ДополнительныеПараметрыОповещения = Новый Структура();
			ДополнительныеПараметрыОповещения.Вставить("ПараметрыСоединенияProCredit",ПараметрыСоединенияProCredit);
			ДополнительныеПараметрыОповещения.Вставить("СтруктураПарметровЗапросаВБанк",СтруктураПарметровЗапросаВБанк);
			ДополнительныеПараметрыОповещения.Вставить("МассивСтруктурВалют", МассивСтруктурВалют);
			
			Подсказка = НСтр("ka='ProCredit ინტეგრაცია: შეიყვანეთ OTP –ის პაროლი';ru='Интеграция с ProCredit: Введите пароль OTP'");
			ОповещениеВводаСтроки = Новый ОписаниеОповещения("ЗавершениеВводаПароляOTP", ЭтотОбъект, ДополнительныеПараметрыОповещения);
			ПоказатьВводСтроки(ОповещениеВводаСтроки,,Подсказка,,ИСТИНА);
			
		КонецЕсли;
		
	ИначеЕсли BOG Тогда  
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Находиться в разработке'; ka = 'Находиться в разработке'"));
	ИначеЕсли TBC Тогда       
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Находиться в разработке'; ka = 'Находиться в разработке'"));
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ЗавершениеВводаПароляOTP(Результат, ДополнительныеПараметры) ЭКСПОРТ
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		ПараметрыСоединенияProCredit = ДополнительныеПараметры.ПараметрыСоединенияProCredit;
		СтруктураПарметровЗапросаВБанк = ДополнительныеПараметры.СтруктураПарметровЗапросаВБанк;  
		МассивСтруктурВалют = ДополнительныеПараметры.МассивСтруктурВалют;
		
		ПараметрыСоединенияProCredit.OTP = СокрЛП(Результат);
		ПолучитьКурсБанка(ПараметрыСоединенияProCredit, СтруктураПарметровЗапросаВБанк, МассивСтруктурВалют);
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПолучитьКурсБанка(ПараметрыСоединенияProCredit, СтруктураПарметровЗапросаВБанк, МассивСтруктурВалют) ЭКСПОРТ
	
	Для Каждого Валюты Из МассивСтруктурВалют Цикл 
		
		СтруктураФильтра = Новый Структура;
		СтруктураФильтра.Вставить("SellCurrency", Валюты.SellCurrency);
		СтруктураФильтра.Вставить("BuyCurrency", Валюты.BuyCurrency);     
		СтруктураФильтра.Вставить("SellCurrencyСсылка", Валюты.SellCurrencyСсылка);
		СтруктураФильтра.Вставить("BuyCurrencyСсылка", Валюты.BuyCurrencyСсылка);
		СтруктураФильтра.Вставить("Банк", Банк);
		
		СтруктураПарметровЗапросаВБанк = Новый Структура();
		СтруктураПарметровЗапросаВБанк.Вставить("ИмяМетода","GetRate"); 
		СтруктураПарметровЗапросаВБанк.Вставить("ИмяСервиса","api/Rate/GetRate");
		СтруктураПарметровЗапросаВБанк.Вставить("ФильтраЗапроса", СтруктураФильтра);
		
		ДополнительныеПараметрыОповещения = Новый Структура();
		ДополнительныеПараметрыОповещения.Вставить("ПараметрыСоединенияProCredit",ПараметрыСоединенияProCredit);
		ДополнительныеПараметрыОповещения.Вставить("СтруктураПарметровЗапросаВБанк",СтруктураПарметровЗапросаВБанк);
		
		ИнтеграцияСБанкомProCredit_КлиентСервер.ВыполнитьЗапросВБанк(ПараметрыСоединенияProCredit, СтруктураПарметровЗапросаВБанк);
		
		ОбработатьРезультатыПолученияКурсаБанкаИзProCredit(СтруктураПарметровЗапросаВБанк);
		
	КонецЦикла;
	
	ИнтеграцияСБанкомProCredit_КлиентСервер.ВыполнитьЗапросВБанк(ПараметрыСоединенияProCredit, СтруктураПарметровЗапросаВБанк);
	
	ОбработатьРезультатыПолученияКурсаБанкаИзProCredit(СтруктураПарметровЗапросаВБанк);

КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатыПолученияКурсаБанкаИзProCredit(СтруктураПарметровЗапросаВБанк)
	
	ТаблицаКурсов = ПолучитьИзВременногоХранилища(СтруктураПарметровЗапросаВБанк.ТаблицаДвиженийПоСчету);
	Если ТаблицаКурсов.Количество()>0 Тогда
		
		Для каждого СтрокаТаблицаКурсов Из ТаблицаКурсов Цикл
			
			НаборЗаписейКурсыВалютБанков = РегистрыСведений.КурсыВалютБанков.СоздатьНаборЗаписей();     
			НаборЗаписейКурсыВалютБанков.Отбор.Банк.Установить(Банк);
			
			Если ВалютаУчета = СтруктураПарметровЗапросаВБанк.ФильтраЗапроса.SellCurrencyСсылка Тогда 
				
				НаборЗаписейКурсыВалютБанков.Отбор.ВидКурса.Установить(Перечисления.ВидыКурсовВалютБанка.Коммерческий);    
				НаборЗаписейКурсыВалютБанков.Отбор.Валюта.Установить(СтруктураПарметровЗапросаВБанк.ФильтраЗапроса.BuyCurrencyСсылка);
				
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("ВидКурса", Перечисления.ВидыКурсовВалютБанка.Коммерческий);   
				СтруктураОтбора.Вставить("Банк", Банк);
				СтруктураОтбора.Вставить("Валюта",СтруктураПарметровЗапросаВБанк.ФильтраЗапроса.BuyCurrencyСсылка); 
				
				тзКурсыВалютБанков = РегистрыСведений.КурсыВалютБанков.СрезПоследних(ТекущаяДата(), СтруктураОтбора);  
				
				КурсПродажи = 0;
				КратностьПродажи = 0;
				Для Каждого Строк Из тзКурсыВалютБанков Цикл  
					КурсПродажи = Строк.КурсПродажи;
					КратностьПродажи = Строк.КратностьПродажи;
				КонецЦикла;  
				
				ЗаписьКурсыВалютБанков = НаборЗаписейКурсыВалютБанков.Добавить();        
				
				ЗаписьКурсыВалютБанков.Период = НачалоДня(ТекущаяДата());
				ЗаписьКурсыВалютБанков.Банк = Банк;
				ЗаписьКурсыВалютБанков.ВидКурса = Перечисления.ВидыКурсовВалютБанка.Коммерческий;  
				ЗаписьКурсыВалютБанков.Валюта = СтруктураПарметровЗапросаВБанк.ФильтраЗапроса.BuyCurrencyСсылка;
				ЗаписьКурсыВалютБанков.КурсПродажи = КурсПродажи;
				ЗаписьКурсыВалютБанков.КратностьПродажи = КратностьПродажи;   
				ЗаписьКурсыВалютБанков.КурсПокупки = СтрокаТаблицаКурсов.Курс;
				ЗаписьКурсыВалютБанков.КратностьПокупки = 1;
				
			ИначеЕсли ВалютаУчета = СтруктураПарметровЗапросаВБанк.ФильтраЗапроса.BuyCurrencyСсылка Тогда
				
				НаборЗаписейКурсыВалютБанков.Отбор.ВидКурса.Установить(Перечисления.ВидыКурсовВалютБанка.Коммерческий);    
				НаборЗаписейКурсыВалютБанков.Отбор.Валюта.Установить(СтруктураПарметровЗапросаВБанк.ФильтраЗапроса.SellCurrencyСсылка);  
				
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("ВидКурса", Перечисления.ВидыКурсовВалютБанка.Коммерческий);   
				СтруктураОтбора.Вставить("Банк", Банк);
				СтруктураОтбора.Вставить("Валюта", СтруктураПарметровЗапросаВБанк.ФильтраЗапроса.SellCurrencyСсылка); 
				
				тзКурсыВалютБанков = РегистрыСведений.КурсыВалютБанков.СрезПоследних(ТекущаяДата(), СтруктураОтбора);  
				
				КурсПокупки = 0;
				КратностьПокупки = 0;
				Для Каждого Строк Из тзКурсыВалютБанков Цикл  
					КурсПокупки = Строк.КурсПокупки;
					КратностьПокупки = Строк.КратностьПокупки;
				КонецЦикла;
				
				ЗаписьКурсыВалютБанков = НаборЗаписейКурсыВалютБанков.Добавить();
				
				ЗаписьКурсыВалютБанков.Период = НачалоДня(ТекущаяДата());
				ЗаписьКурсыВалютБанков.Банк = Банк;
				ЗаписьКурсыВалютБанков.ВидКурса = Перечисления.ВидыКурсовВалютБанка.Коммерческий;  
				ЗаписьКурсыВалютБанков.Валюта = СтруктураПарметровЗапросаВБанк.ФильтраЗапроса.SellCurrencyСсылка; 
				ЗаписьКурсыВалютБанков.КурсПродажи = СтрокаТаблицаКурсов.Курс;
				ЗаписьКурсыВалютБанков.КратностьПродажи = 1;
				ЗаписьКурсыВалютБанков.КурсПокупки = КурсПокупки;
				ЗаписьКурсыВалютБанков.КратностьПокупки = КратностьПокупки;
				
			Иначе                            
				
				НаборЗаписейКурсыВалютБанков.Отбор.ВидКурса.Установить(Перечисления.ВидыКурсовВалютБанка.Кросс); 
				НаборЗаписейКурсыВалютБанков.Отбор.ВалютаПокупки.Установить(СтруктураПарметровЗапросаВБанк.ФильтраЗапроса.BuyCurrencyСсылка);
				НаборЗаписейКурсыВалютБанков.Отбор.ВалютаПродажи.Установить(СтруктураПарметровЗапросаВБанк.ФильтраЗапроса.SellCurrencyСсылка);
				
				ЗаписьКурсыВалютБанков = НаборЗаписейКурсыВалютБанков.Добавить();
				
				ЗаписьКурсыВалютБанков.Период = НачалоДня(ТекущаяДата());
				ЗаписьКурсыВалютБанков.Банк = Банк;
				ЗаписьКурсыВалютБанков.ВидКурса = Перечисления.ВидыКурсовВалютБанка.Кросс;  
				ЗаписьКурсыВалютБанков.ВалютаПродажи = СтруктураПарметровЗапросаВБанк.ФильтраЗапроса.SellCurrencyСсылка;
				ЗаписьКурсыВалютБанков.ВалютаПокупки = СтруктураПарметровЗапросаВБанк.ФильтраЗапроса.BuyCurrencyСсылка;
				ЗаписьКурсыВалютБанков.КурсКросс = СтрокаТаблицаКурсов.Курс;
				ЗаписьКурсыВалютБанков.КратностьКросс = 1;   
				
			КонецЕсли;
			
			НаборЗаписейКурсыВалютБанков.Записать(Истина);
					
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОбменаСИнтернетБанкомПриИзменении(Элемент)     
	
	Если ТипОбменаСИнтернетБанком = "ProCredit" Тогда 
		ProCredit = Истина;     
	ИначеЕсли ТипОбменаСИнтернетБанком = "TBC" Тогда             
		TBC = Истина;
	ИначеЕсли ТипОбменаСИнтернетБанком = "CARTU" Тогда        
		CARTU = Истина;
	ИначеЕсли ТипОбменаСИнтернетБанком = "VTB" Тогда      
		VTB = Истина;
	ИначеЕсли ТипОбменаСИнтернетБанком = "BOG" Тогда   
		BOG = Истина;
	КонецЕсли;
	
	НайтиБанк();
КонецПроцедуры

&НаСервере
Процедура НайтиБанк()         
	
	Если BOG Тогда 
		Банк = Справочники.Банки.НайтиПоРеквизиту("СВИФТБИК", "BAGAGE22");
	ИначеЕсли TBC Тогда             
		Банк = Справочники.Банки.НайтиПоРеквизиту("СВИФТБИК", "TBCBGE22");
	ИначеЕсли CARTU Тогда        
		Банк = Справочники.Банки.НайтиПоРеквизиту("СВИФТБИК", "CRTUGE22");
	ИначеЕсли VTB Тогда      
		
	ИначеЕсли ProCredit Тогда   
		Банк = Справочники.Банки.НайтиПоРеквизиту("СВИФТБИК", "MIBGGE22");
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ВалютаУчета			= УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ВалютаУчета");
	
КонецПроцедуры


&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры
